import * as yup from "yup";

export const AddVacancySchema = yup.object().shape({
  name: yup
    .string()
    .required("ვაკანსიის სახელი სავალდებულოა")
    .min(2, "ვაკანსიის სახელი უნდა იყოს მინიმუმ 2 სიმბოლო"),
  sallery: yup
    .number()
    .typeError("ანაზღაურება უნდა იყოს რიცხვი")
    .required("ანაზღაურება სავალდებულოა")
    .min(0, "ანაზღაურება უნდა იყოს 0 ან მეტი"),
  location: yup
    .string()
    .required("მდებარეობა სავალდებულოა")
    .oneOf(
      [
        "IT და პროგრამირება",
  "საგანმანათლებლო",
  "მარკეტინგი",
  "ფინანსები",
  "სამედიცინო სფერო",
  "სამართალი",
  "სამშენებლო",
  "ბუღალტერია, ფინანსები",
  "ავტო-სერვისი",
  "განცხადება, მოლარე, კონსულტანტი",
  "განათლება",
  "გაყიდვები, მარკეტინგი",
  "დაზღვევა, ბანკები",
  "დასუფთავება",
  "დაცვა, უსაფრთხოება",
  "მზარეული, ბარმენი",
  "მექანიკა",
  "მშენებლობა",
  "რემონტი, შენმებობა",
  "საოფისე საქმე, ადმინისტრირება",
  "სასტუმრო, ტურიზმი",
  "სამშენებლო სამგზავროები",
  "სპორტი, გარიგება",
  "ინჟინერია",
  "სტატისტიკა",
  "მენეჯმენტი",
  "ლოგისტიკა, საქმეები",
  "ფარმაცია, ჯანმრთელობა",
  "ხელოვნება, მენეჯმენტი",
  "ხელოსანი, შეკეთება, მორთული",
  "ჭკა, მომღერლე, დამხმარე",
  "წყალქვეშა მეხანძრე",
      ],
      "აირჩიეთ სწორი მდებარეობა"
    ),
    workplace: yup
    .string()
    .required("სამუშაო ადგილის არჩევა სავალდებულოა")
    .oneOf(["ადგილზე", "სახლში", "არჩევით"], "აირჩიეთ სწორი სამუშაო ადგილი"),

  duration: yup
    .string()
    .required("დროის მონაკვეთის არჩევა სავალდებულოა")
    .oneOf(
      ["ნახევარ განაკვეთიანი", "სრულ განაკვეთიანი", "შერეული"],
      "აირჩიეთ სწორი დროის მონაკვეთი"
    ),

  description: yup
    .string()
    .required("აღწერა სავალდებულოა")
    .min(10, "აღწერა უნდა იყოს მინიმუმ 10 სიმბოლო"),
});

export type AddVacancyType = yup.InferType<typeof AddVacancySchema>;